In [1]:
import pandas as pd

d = {"USN":[100,101,102],
     "Name":[None, "tom", "ramesh"],
     "Mobile":[99,88,77],
     "marks":[30,35,None],
    }

In [2]:
#mod1
std = pd.DataFrame(d)

In [3]:
std.head()

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [4]:
std.head(2)

   USN  Name  Mobile  marks
0  100  None      99   30.0
1  101   tom      88   35.0

In [5]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    2 non-null      object
 2   Mobile  3 non-null      int64
 3   marks   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [6]:
std.isnull()

     USN   Name  Mobile  marks
0  False   True   False  False
1  False  False   False  False
2  False  False   False   True

In [7]:
#accessing columns
std["USN"]
#multiple columns
std[["USN", "marks"]]

   USN  marks
0  100   30.0
1  101   35.0
2  102    NaN

In [8]:
#getting the rows 
std.loc[1]

USN        101
Name       tom
Mobile      88
marks     35.0
Name: 1, dtype: object

In [9]:
#question
cars = {"car_id":[100,101,102,103,104,105],
        "car_name":["ecosport", "jaguar", "supra","Polo GT", "Audi Q5",None],
        
}

In [10]:
df = pd.DataFrame(cars)

In [11]:
df

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra
3     103   Polo GT
4     104   Audi Q5
5     105      None

In [12]:
df.head(3)

   car_id  car_name
0     100  ecosport
1     101    jaguar
2     102     supra

In [13]:
df.loc[3]

car_id          103
car_name    Polo GT
Name: 3, dtype: object

In [14]:
df.isnull()

   car_id  car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [15]:
df.iloc[4]

car_id          104
car_name    Audi Q5
Name: 4, dtype: object

In [16]:
#setting a new index
index = ["A","B","C"]
std.set_index("USN")

# # #or 
# D = std.DataFrame(d, index = ["A","B","C"])

std

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [17]:
#conditional selection
std["marks"]<35

0     True
1    False
2    False
Name: marks, dtype: bool

In [18]:
#if you want the values
std.loc[std["marks"]<35]

#or

   USN  Name  Mobile  marks
0  100  None      99   30.0

In [19]:
newdf = std["marks"]<35
std[newdf][["Name","Mobile","USN"]]

   Name  Mobile  USN
0  None      99  100

In [20]:
#multiple conditions
std[(std["Name"] == "jerry")&(std["marks"]>20)]

Empty DataFrame
Columns: [USN, Name, Mobile, marks]
Index: []

In [21]:
std[(std["USN"]>100)|(std["marks"]<40)]

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [22]:
#adding new column
s = "banglore,delhi,kashmir".split(",")
print(s,type)
std["Address"] = s
std

['banglore', 'delhi', 'kashmir'] <class 'type'>

   USN    Name  Mobile  marks   Address
0  100    None      99   30.0  banglore
1  101     tom      88   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [23]:
#delete column
std.drop("Address",axis = 1,inplace = True)#inplace = true makes the column dissapear permanently

In [24]:
std

   USN    Name  Mobile  marks
0  100    None      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [73]:
#handling missing values
std.dropna(thresh =3,axis = 0) #thresh parameter value decides the minimum number of non-NAN values needed in a "ROW" not to drop

   USN    Name  Mobile  marks  Total
0  100    None      99   30.0  129.0
1  101     tom      88   35.0  123.0
2  102  ramesh      77    NaN    NaN

In [75]:
std.dropna(thresh =2,axis = 1)

   USN    Name  Mobile  marks  Total
0  100    None      99   30.0  129.0
1  101     tom      88   35.0  123.0
2  102  ramesh      77    NaN    NaN

In [82]:
#adding missing values
std["marks"].fillna("not confirmed", inplace = False)

std

   USN    Name  Mobile          marks  Total
0  100    None      99           30.0  129.0
1  101     tom      88           35.0  123.0
2  102  ramesh      77  not confirmed    NaN

In [111]:
x =std["Total"].mode()[1]
std.fillna(x)

   USN    Name  Mobile          marks  Total
0  100   129.0      99           30.0  129.0
1  101     tom      88           35.0  123.0
2  102  ramesh      77  not confirmed  129.0

In [109]:
x=std['Total'].mode()

In [110]:
x

0    123.0
1    129.0
Name: Total, dtype: float64

In [27]:
std["Total"] = std["Mobile"] + std["marks"]
std

   USN    Name  Mobile  marks  Total
0  100    None      99   30.0  129.0
1  101     tom      88   35.0  123.0
2  102  ramesh      77    NaN    NaN

In [28]:
#mod 2


d1 = {'c1':[1,2,3],
      'c2':[10,11,6]
      }

d2= {'c2':[10,11,12],
      'c4':[31,32,33]
     }

d3 = {'c5':[41,42,43],
      'c6':[51,52,53]
     }

In [29]:
df1 = pd.DataFrame(d1)
df1

   c1  c2
0   1  10
1   2  11
2   3   6

In [30]:
df2 = pd.DataFrame(d2)
df2

   c2  c4
0  10  31
1  11  32
2  12  33

In [31]:
df3 = pd.DataFrame(d3)
df3

   c5  c6
0  41  51
1  42  52
2  43  53

In [32]:
pd.concat([df1,df2], axis = 0)

    c1  c2    c4
0  1.0  10   NaN
1  2.0  11   NaN
2  3.0   6   NaN
0  NaN  10  31.0
1  NaN  11  32.0
2  NaN  12  33.0

In [33]:
pd.merge(df1, df2, how = 'inner', on = 'c2')# how tells which columns to use

   c1  c2  c4
0   1  10  31
1   2  11  32

In [105]:
d={'usn':[100,101,102],
  'name':[None,'ram','ramesh'],
  'mobile':[99,88,77],
  'marks':[56,67,None]}

In [106]:
df0=pd.DataFrame(d)

In [107]:
df0

   usn    name  mobile  marks
0  100    None      99   56.0
1  101     ram      88   67.0
2  102  ramesh      77    NaN

In [39]:
D1 = {'usn':[100,101,102],
      'name':["Aakash", "dhruv", "sam"]

}
D2 = {'usn':[104,101,103],
       'marks':[90,80,70]
}

In [40]:
DF1 = pd.DataFrame(D1)
DF1

   usn    name
0  100  Aakash
1  101   dhruv
2  102     sam

In [41]:
DF2 = pd.DataFrame(D2)
DF2

   usn  marks
0  104     90
1  101     80
2  103     70

In [42]:
pd.merge(DF1,DF2, how = 'left', on = 'usn')

   usn    name  marks
0  100  Aakash    NaN
1  101   dhruv   80.0
2  102     sam    NaN

In [ ]:
pd.merge(DF1,DF2, how = 'right', on = 'usn')

In [ ]:
DF1.join(DF2)